testsuite_results/sysbench/results/oltp_write_only.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 3173.59 qps: 19047.33 (r/w/o: 0.00/12698.14/6349.19) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 3323.60 qps: 19942.92 (r/w/o: 0.00/13295.51/6647.41) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 3345.16 qps: 20076.99 (r/w/o: 0.00/13386.68/6690.31) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           794436
        other:                           397224
        total:                           1191660
    transactions:                        198644 (3309.75 per sec.)
    queries:                             1191660 (19855.12 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3309.7539
    time elapsed:                        60.0179s
    total number of events:              198644

Latency (ms):
         min:                                    5.54
         avg:                                   19.33
         max:                                   62.63
         95th percentile:                       23.10
         sum:                              3840441.10

Threads fairness:
    events (avg/stddev):           3103.8125/15.14
    execution time (avg/stddev):   60.0069/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 3363.82 qps: 20193.60 (r/w/o: 0.00/13463.82/6729.78) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 3373.86 qps: 20243.14 (r/w/o: 0.00/13495.43/6747.71) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 3416.05 qps: 20496.29 (r/w/o: 0.00/13664.20/6832.10) lat (ms,95%): 22.28 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           813692
        other:                           406910
        total:                           1220602
    transactions:                        203487 (3390.72 per sec.)
    queries:                             1220602 (20338.97 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3390.7170
    time elapsed:                        60.0131s
    total number of events:              203487

Latency (ms):
         min:                                    5.13
         avg:                                   18.87
         max:                                   51.05
         95th percentile:                       22.28
         sum:                              3840430.66

Threads fairness:
    events (avg/stddev):           3179.4844/30.54
    execution time (avg/stddev):   60.0067/0.00